# IFCProperty Mapping Info(Boolean, String, Element Id, String) Constructor

Source: https://www.revitapidocs.com/2026/d8a51852-e001-31b4-447d-58b3731f2c67.htm

---

| IFCProperty Mapping Info(Boolean, String, Element Id, String) Constructor |
| --- |

Constructs a new IFCPropertyMappingInfo with input values.
 The flag that indicates whether the property is included in export.
 The property name.
 The Revit property id.
 The Revit property id.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IFCPropertyMappingInfo(
	bool exportFlag,
	string ifcPropertyName,
	ElementId revitPropertyId,
	string revitPropertyName
)
```

```
Public Sub New (
	exportFlag As Boolean,
	ifcPropertyName As String,
	revitPropertyId As ElementId,
	revitPropertyName As String
)
```

```
public:
IFCPropertyMappingInfo(
	bool exportFlag,
	String^ ifcPropertyName,
	ElementId^ revitPropertyId,
	String^ revitPropertyName
)
```

```
new :
        exportFlag : bool *
        ifcPropertyName : string *
        revitPropertyId : ElementId *
        revitPropertyName : string -> IFCPropertyMappingInfo
```

#### Parameters

exportFlag Boolean
ifcPropertyName String
revitPropertyId ElementId
revitPropertyName String

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

IFCPropertyMappingInfo Class IFCPropertyMappingInfo Overload Autodesk.Revit.DB Namespace